## Question 1 (Cutlets.csv)

In [1]:
#importing libraries
import pandas as pd
import numpy as np
from scipy import stats

In [2]:
#reading csv file
cutlets=pd.read_csv('Cutlets.csv')

In [3]:
#H0= no difference in diameter of cutlet
#H1= difference in diameter of cutlet
#alpha=0.05

In [4]:
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [5]:
cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [6]:
stats.ttest_ind(cutlets.iloc[:,0],cutlets.iloc[:,1])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [7]:
#p value is greater than 0.05
#failed to reject null hypothesis
#there is no significant difference in the diameter of the cutlet between two units.

## Question 2 (LabTAT.csv)

In [8]:
#reading csv file
tat=pd.read_csv('LabTAT.csv')

In [9]:
#H0= same average TAT of reports of labs
#H1= difference in average TAT of reports of labs
#alpha= 0.05

In [10]:
tat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [11]:
tat.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [12]:
stats.f_oneway(tat.iloc[:,0],tat.iloc[:,1],tat.iloc[:,2],tat.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [13]:
# p value less than 0.05
# reject null hypothesis
# there is significant difference in average TAT of reports of different laboratories

## Question 3 (BuyerRatio.csv)

In [14]:
#reading csv file
br=pd.read_csv('BuyerRatio.csv')

In [15]:
# H0= all proportions are equal
# H1= not all proportions are equal
# assuming 95% confidence, alpha= 0.05

In [16]:
br.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [24]:
#excluding column
br_1=br.loc[:, br.columns!='Observed Values']
br_1

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [23]:
stats.chi2_contingency(br_1)

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [26]:
# p value greater than 0.05
# failed to reject null hypothesis
# all proportions are equal i.e., male female buyer ratio is similar across all regions.

## Question 4 (Customer+OrderForm.csv)

In [27]:
# reading csv file
telecall=pd.read_csv('Customer+OrderForm.csv')

In [28]:
# H0= defective % does not vary by centre
# H1= defective % varies by centre
# alpha= 0.05

In [29]:
telecall.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [30]:
telecall.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [36]:
error_free=[271,267,269,280]
defective=[29,33,31,20]    # (300-271)=29, (300-267)=33, (300-269)=31, (300-280)=20

In [46]:
telecall_obs=np.array([[error_free],[defective]])
telecall_obs

array([[[271, 267, 269, 280]],

       [[ 29,  33,  31,  20]]])

In [47]:
stats.chi2_contingency(telecall_obs)

Chi2ContingencyResult(statistic=3.858960685820355, pvalue=0.2771020991233135, dof=3, expected_freq=array([[[271.75, 271.75, 271.75, 271.75]],

       [[ 28.25,  28.25,  28.25,  28.25]]]))

In [48]:
# p value more than 0.05
# failed to reject null hypothesis
# therefore defective % of customer order form does not vary by centre